# Pandas practice

This is my first file for Data Engineering course.

In [7]:
print("Hello")

Hello

print("Hello")

In [4]:
import pandas as pd

In [5]:
import csv

In [9]:
pdf_data = pd.read_csv("marketing_campaign.csv", sep="\t")

In [11]:
pdf_data.head(5)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [13]:
pdf_data[:2]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0

In [14]:
pdf_data[10:12]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
10,1994,1983,Graduation,Married,NaN,1,0,15-11-2013,11,5,...,7,0,0,0,0,0,0,3,11,0
11,387,1976,Basic,Married,7500.0,0,0,13-11-2012,59,6,...,8,0,0,0,0,0,0,3,11,0

In [12]:
pdf_data.tail(5)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [15]:
pdf_data.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

Year_Birth, Education, Marital_Status, Income, Kidhome, Teenhome, Mnt*

In [19]:
pdf_data.drop(['ID', 'Dt_Customer', 'Recency', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'], axis=1, inplace=True)

In [20]:
pdf_data

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
0,1957,Graduation,Single,58138.0,0,0,635,88,546,172,88,88
1,1954,Graduation,Single,46344.0,1,1,11,1,6,2,1,6
2,1965,Graduation,Together,71613.0,0,0,426,49,127,111,21,42
3,1984,Graduation,Together,26646.0,1,0,11,4,20,10,3,5
4,1981,PhD,Married,58293.0,1,0,173,43,118,46,27,15
...,...,...,...,...,...,...,...,...,...,...,...,...
2235,1967,Graduation,Married,61223.0,0,1,709,43,182,42,118,247
2236,1946,PhD,Together,64014.0,2,1,406,0,30,0,0,8
2237,1981,Graduation,Divorced,56981.0,0,0,908,48,217,32,12,24
2238,1956,Master,Together,69245.0,0,1,428,30,214,80,30,61
2239,1954,PhD,Married,52869.0,1,1,84,3,61,2,1,21

In [22]:
pdf_data.dropna(axis=0, how='any', inplace=True)

In [23]:
pdf_data

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
0,1957,Graduation,Single,58138.0,0,0,635,88,546,172,88,88
1,1954,Graduation,Single,46344.0,1,1,11,1,6,2,1,6
2,1965,Graduation,Together,71613.0,0,0,426,49,127,111,21,42
3,1984,Graduation,Together,26646.0,1,0,11,4,20,10,3,5
4,1981,PhD,Married,58293.0,1,0,173,43,118,46,27,15
...,...,...,...,...,...,...,...,...,...,...,...,...
2235,1967,Graduation,Married,61223.0,0,1,709,43,182,42,118,247
2236,1946,PhD,Together,64014.0,2,1,406,0,30,0,0,8
2237,1981,Graduation,Divorced,56981.0,0,0,908,48,217,32,12,24
2238,1956,Master,Together,69245.0,0,1,428,30,214,80,30,61
2239,1954,PhD,Married,52869.0,1,1,84,3,61,2,1,21

In [26]:
pdf_data[8:12] #index 10 was dropped

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
8,1974,PhD,Together,30351.0,1,0,14,0,24,3,3,2
9,1950,PhD,Together,5648.0,1,1,28,0,6,1,1,13
11,1976,Basic,Married,7500.0,0,0,6,16,11,11,1,16
12,1959,Graduation,Divorced,63033.0,0,0,194,61,480,225,112,30

In [27]:
pdf_data['Marital_Status'][:5]

0      Single
1      Single
2    Together
3    Together
4     Married
Name: Marital_Status, dtype: object

In [28]:
pdf_data['Marital_Status'].unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone',
       'Absurd', 'YOLO'], dtype=object)

In [29]:
pdf_data['Marital_Status'].value_counts()

Married     857
Together    573
Single      471
Divorced    232
Widow        76
Alone         3
Absurd        2
YOLO          2
Name: Marital_Status, dtype: int64

In [30]:
pdf_data['Income'][:5]

0    58138.0
1    46344.0
2    71613.0
3    26646.0
4    58293.0
Name: Income, dtype: float64

In [31]:
pdf_data['Income'].mean()

52247.25135379061

In [32]:
pdf_data['Income'].std()

25173.07666090141

In [34]:
pdf_data['Income'].mean(), pdf_data['Income'].std()

(52247.25135379061, 25173.07666090141)

In [36]:
pdf_data[['Income', 'Education', 'Marital_Status']][:5]

    Income   Education Marital_Status
0  58138.0  Graduation         Single
1  46344.0  Graduation         Single
2  71613.0  Graduation       Together
3  26646.0  Graduation       Together
4  58293.0         PhD        Married

In [38]:
pdf_data[['Income', 'Education', 'Marital_Status']].groupby(by=['Education', 'Marital_Status']).agg({'Income': 'mean'})

                                 Income
Education  Marital_Status
2n Cycle   Divorced        49395.130435
           Married         46201.100000
           Single          53673.944444
           Together        44736.410714
           Widow           51392.200000
Basic      Divorced         9548.000000
           Married         21960.500000
           Single          18238.666667
           Together        21240.071429
           Widow           22123.000000
Graduation Absurd          79244.000000
           Alone           34176.000000
           Divorced        54526.042017
           Married         50800.258741
           Single          51322.182927
           Together        55758.480702
           Widow           54976.657143
Master     Absurd          65487.000000
           Alone           61331.000000
           Divorced        50331.945946
           Married         53286.028986
           Single          53530.560000
           Together        52109.009804
           Widow           58401.545455
PhD        Alone           35860.000000
           Divorced        53096.615385
           Married         58138.031579
           Single          53314.614583
           Together        56041.422414
           Widow           60288.083333
           YOLO            48432.000000

In [40]:
pdf_temp = pdf_data[pdf_data['Year_Birth'] > 1980]

In [43]:
pdf_temp.sort_values(by='Income', ascending=False)[:3] #highest income born after 1980

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
687,1982,PhD,Married,160803.0,0,0,55,16,1622,17,3,4
124,1983,Graduation,Single,101970.0,0,0,722,27,102,44,72,168
1958,1990,Graduation,Single,96843.0,0,0,448,71,951,40,17,17